; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-9)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 )
(:init
(arm-empty)
(on b1 b7)
(on-table b2)
(on b3 b1)
(on-table b4)
(on b5 b4)
(on-table b6)
(on-table b7)
(on b8 b6)
(on b9 b2)
(clear b3)
(clear b5)
(clear b8)
(clear b9)
)
(:goal
(and
(on b1 b5)
(on b3 b6)
(on b4 b9)
(on b7 b2)
(on b8 b1)
(on b9 b8))
)
)

; plan
1. (unstack b8 b6)
   deleted: (on b8 b6) (clear b8) (arm-empty)
   added: (holding b8) (clear b6)
   goals met: 0 of 6
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 6
3. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 0 of 6
4. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 1 of 6
5. (unstack b5 b4)
   deleted: (on b5 b4) (clear b5) (arm-empty)
   added: (holding b5) (clear b4)
   goals met: 1 of 6
6. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 6
7. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 1 of 6
8. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 2 of 6
9. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 2 of 6
10. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 3 of 6
11. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 3 of 6
12. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 4 of 6
13. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 4 of 6
14. (stack b4 b9)
   deleted: (clear b9) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b9)
   goals met: 5 of 6
15. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 5 of 6
16. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 6 of 6
